In [2]:
2 + 2

4

In [6]:
print("Hello World")

Hello World

In [21]:
text123 = "Data Carpentry"
number=42
pi_value = 3.145

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

number
text123
print(pi_value)

42

'Data Carpentry'

3.145

In [48]:
a_list = [1, 3, 4, 5]
a_tuple = (1, 2, 3, 4)

a_list[1] = 5
a_list.append(12222)
a_list

type(a_tuple)

[1, 5, 4, 5, 12222]

tuple

In [57]:
translation = {'one': 'first', 'two': 'second'}
rev = {'first': 'one', 'second': 'two'}

for key, value in rev.items():
    print(key, '===', value)

first === one
second === two

In [62]:
def add_function(a, b):
    result = (a + b) * 100 
    result = "this is my result " + str(result)
    return result
z = add_function(20, 22)
print(z)

this is my result 4200

In [87]:
import os
os.chdir("C:/bshih")

import pandas as pd
surveys_df = pd.read_csv("C:/bshih/data/surveys.csv")

surveys_df.dtypes

record_id            int64
month                int64
day                  int64
year                 int64
plot_id              int64
species_id          object
sex                 object
hindfoot_length    float64
weight             float64
dtype: object

In [92]:
surveys_df.columns
pd.unique(surveys_df['species_id'])
surveys_df.head()

Index(['record_id', 'month', 'day', 'year', 'plot_id', 'species_id', 'sex',
       'hindfoot_length', 'weight'],
      dtype='object')

array(['NL', 'DM', 'PF', 'PE', 'DS', 'PP', 'SH', 'OT', 'DO', 'OX', 'SS',
       'OL', 'RM', nan, 'SA', 'PM', 'AH', 'DX', 'AB', 'CB', 'CM', 'CQ',
       'RF', 'PC', 'PG', 'PH', 'PU', 'CV', 'UR', 'UP', 'ZL', 'UL', 'CS',
       'SC', 'BA', 'SF', 'RO', 'AS', 'SO', 'PI', 'ST', 'CU', 'SU', 'RX',
       'PB', 'PL', 'PX', 'CT', 'US'], dtype=object)

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN

In [101]:
site_names = pd.unique(surveys_df['plot_id'])
site_names
len(site_names)
len(surveys_df['plot_id'].unique())

array([ 2,  3,  7,  1,  6,  5,  8,  4, 11, 14, 15, 13,  9, 10, 17, 16, 20,
       23, 18, 21, 22, 19, 12, 24], dtype=int64)

24

24

In [111]:

grouped_data = surveys_df.groupby('sex')
grouped_data.describe()
grouped_data.mean()

    record_id                                                               \
        count          mean           std  min      25%      50%       75%
sex
F     15690.0  18036.412046  10423.089000  3.0  8917.50  18075.5  27250.00
M     17348.0  17754.835601  10132.203323  1.0  8969.75  17727.5  26454.25

                month            ... hindfoot_length         weight  \
         max    count      mean  ...             75%   max    count
sex                              ...
F    35547.0  15690.0  6.587253  ...            36.0  64.0  15303.0
M    35548.0  17348.0  6.396184  ...            36.0  58.0  16879.0


          mean        std  min   25%   50%   75%    max
sex
F    42.170555  36.847958  4.0  20.0  34.0  46.0  274.0
M    42.995379  36.184981  4.0  20.0  39.0  49.0  280.0

[2 rows x 56 columns]

,record_id,month,day,year,plot_id,hindfoot_length,weight
sex,,,,,,,
F,18036.412046,6.587253,15.880943,1990.644997,11.440854,28.836780,42.170555
M,17754.835601,6.396184,16.078799,1990.480401,11.098282,29.709578,42.995379

In [114]:
surveys_df['weight'].mean()

42.672428212991356

In [116]:
len(surveys_df[pd.isnull(surveys_df.weight)])

3266

In [120]:
len(surveys_df[surveys_df.weight > 0])
len(surveys_df)

32283

35549

In [126]:
df1 = surveys_df.copy()
df1['weight'] = df1['weight'].fillna(0)
df1['weight'].mean()
df1['weight'] = surveys_df['weight'].fillna(surveys_df['weight'].mean())

38.751976145601844

In [162]:
surveys_df.isna().sum()
df1.isna().sum()

record_id             0
month                 0
day                   0
year                  0
plot_id               0
species_id          763
sex                2511
hindfoot_length    4111
weight             3266
dtype: int64

record_id             0
month                 0
day                   0
year                  0
plot_id               0
species_id          763
sex                2511
hindfoot_length    4111
weight                0
dtype: int64

In [179]:
import pandas as pd

surveys_df = pd.read_csv("data/surveys.csv")

surveys_df.head()

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN

In [198]:
surveys_species = surveys_df['species_id']

my_list_of_colnames = ['species_id', 'plot_id']
my_list_of_colnames

surveys_df[['species_id', 'plot_id']]
surveys_df[['plot_id', 'species_id']]

['species_id', 'plot_id']

      species_id  plot_id
0             NL        2
1             NL        3
2             DM        2
3             DM        7
4             DM        3
...          ...      ...
35544         AH       15
35545         AH       15
35546         RM       10
35547         DO        7
35548        NaN        5

[35549 rows x 2 columns]

       plot_id species_id
0            2         NL
1            3         NL
2            2         DM
3            7         DM
4            3         DM
...        ...        ...
35544       15         AH
35545       15         AH
35546       10         RM
35547        7         DO
35548        5        NaN

[35549 rows x 2 columns]

In [212]:
a = [1, 2, 3, 4, 5]
a[0]
surveys_df[0:3]

1

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN

In [215]:
true_copy_surveys_df = surveys_df.copy()

ref_surveys_df = surveys_df

In [240]:
ref_surveys_df[0:3] = 0

surveys_df = pd.read_csv("data/surveys.csv")

In [250]:

surveys_df.loc[0:4, ['plot_id', 'month']]

   plot_id  month
0        2      7
1        3      7
2        2      7
3        7      7
4        3      7